/*************************************************************************
	> 文件名: year.c
	> 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言第2章作业
    > 作业号: 习题3

    概述:将整数移位，并输出。
 ************************************************************************/

#include<stdio.h>

int main()
{
    int a,error;
    do
    {
        error=scanf("%d",&a);
        printf("%d\n",error);
        if(a%3==0&&a%10==5)
        printf("1\n");
        else
        printf("0\n");
    }while(!error==0);
    return 0;
}
