/*************************************************************************
	> 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言作业21
    > 作业号: 习题21

    概述:实现能产生冰雹的程序，魅6个一行，两组数据用空行隔开
 ************************************************************************/

#include<stdio.h>

void hailstone(int k);/*声明函数*/

int main()
{
    int n;
    scanf("%d",&n);
    while(n!=0)/*判断进入循环条件*/
    {
        if(n!=1)
        {
            printf("%5d",n);
            hailstone(n);
            putchar('\n');
        }/*当n！=1时用定义的函数处理*/
        else
        {
            printf("%5d\n\n",1);
        }/*如果它为1,执行这条语句*/
        scanf("%d",&n);/*循环读入*/
    }
    return 0;
}

void hailstone(int n)
{
    int i = 1;
        while(n!=1)
        {   
            if(n%2 == 0)
            {
                n = n/2;
                if(n!=1)
                printf("%5d",n);
                i++;
            }/*如果n为偶数，则除以2*/
            else
            {
                n = 3*n +1;
                printf("%5d",n);
                i++;
            }/*如果n为奇数，则乘以3加一*/
            if(i%6 == 0&&n!=1)
            {
                putchar('\n');
            }/*每6个数输出换行*/
        }
    printf("%5d",1);/*最后输出1*/
    putchar('\n');
}
