/*************************************************************************
	> 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言作业23
    > 作业号: 习题23

    概述:实现库函数strlen()的功能
 ************************************************************************/

#include<stdio.h>

int main()
{
    int n,i=0;
    char test;
    scanf("%d",&n);
    test= getchar();
    for(;i<n;i++)
    {
         int counter = 0;
        while(test = getchar()!='\n')
        {
            counter++;
        }
        printf("%d\n",counter);
    }
}

