/*************************************************************************
	> 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言作业83
    > 作业号: 习题83

    概述:冒泡排序
 ************************************************************************/

#include<stdio.h>
void bubble(int *p);

int main()
{
    int a[10];
    while(scanf("%d",&a[0])!=EOF)
    {
        int i=0;
        for(i=1;i<10;i++)
        {
            scanf("%d",&a[i]);
        }
        bubble(a);/*函数调用*/
        for(i=0;i<10;i++)
        {
            if(i==0)
            printf("%d",a[i]);
            else
            printf("% d",a[i]);
        }/*输出*/
        putchar('\n');
    }
    return 0;
}

void bubble(int *p)
{
    int i,j;
    for(i=1;i<10;i++)
    {
        for(j=0;j<9;j++)
        {
            if(*(p+j)>*((p)+(j+1)))
            {
                *(p+j)=*(p+j)+*((p)+(j+1));
                *((p)+(j+1))=*(p+j)-*((p)+(j+1));
                *(p+j)=*(p+j)-*((p)+(j+1));
            }/*如果第一个数比第二个数大，交换两个数*/
        }
    }
}
