/************************************************************************
    > 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言作业36
    > 作业号: 习题36

    概述:统计每个数字出现次数，字母一共出现的次数，以及其他字符出现的次数
 ************************************************************************/

#include<stdio.h>
void check(char c,int a[]);/*声明函数*/

int main()
{
    int a[12];
    char c;
    int i =0;
    for(;i<11;i++)
    {
        a[i]=0;/*为数组元素赋予初值都为0*/
    }
    while((c = getchar())!=EOF)
    {
        check(c,a);/*逐次读入每个字符，并判断*/
    }
    for(i=0;i<=9;i++)
    {
        printf("Number %d: %d\n",i,a[i]);
    }
    printf("characters: %d\nother: %d\n",a[10],a[11]);/*输出*/
    return 0;
}

void check(char c,int a[])
{
    if((c>='a'&&c<='z')||(c>='A'&&c<='Z'))
    {
        a[10]++;/*如果是字母的话，统计字符的数组元素加一*/
    }
    else if(c>='0'&&c<='9')
    {
        c = c - '0';
        a[c]++;/*如果是数字的话，对应数组元素加一*/
    }
    else
    {
        a[11]++;/*其他字符统计*/
    }
}
