/*************************************************************************
	> 作  者: 张建
    > 班  级: CS1510
    > 学  号: U201514751
	> 邮  箱: 1836810995@qq.com
    > 课  程: C语言作业19
    > 作业号: 习题19

    概述:复制时将多余的空格变为一个
 ************************************************************************/

#include<stdio.h>
int main()
{
    char c;
    int flag=1,i=0,n;/*声明变量*/
    scanf("%d",&n);
    c=getchar();/*忽略输入行数后的回车*/
    for(;i<n;i++)
    {
        while((c=getchar())!='\n')
        {
             switch (c)
            {
                case ' ':
                if(flag==1)
                {
                    putchar(c);
                    flag=0;
                }
                else
                {
                    ;
                }/*忽略多余的空格*/
                break;
                default: 
                putchar(c);
                flag = 1;
                break;/*输出非空格*/
            }
        }
        putchar('\n');
    }
    return 0;/*结束程序*/
}
